{
  "Title": "External Secrets Operator with Azure Key Vault",
  "Summary": "This Jumpstart Drop shows how to manage Azure Key Vault secrets in Kubernetes using the External Secrets Operator. It leverages Microsoft Entra Workload ID for secure sync as native Kubernetes secrets.",
  "Description": "This Jumpstart Drop provides a guide to using the External Secrets Operator with Azure Key Vault. The External Secrets Operator, a Kubernetes operator, enables the management of secrets in external stores like Azure Key Vault. This drop details the configuration of the operator to use Microsoft Entra Workload ID for secure authentication to Azure Key Vault. This setup allows for the automatic synchronization of secrets, keys, and certificates from Azure Key Vault into Kubernetes secrets, making them easily accessible to applications running in the cluster. The steps include installing the External Secrets Operator, setting up managed identities and federated credentials, configuring the SecretStore custom resource, and creating ExternalSecret objects to define which secrets to retrieve from Azure Key Vault. This method offers a streamlined and Kubernetes-native approach to managing secrets stored in Azure Key Vault.",
  "Cover": "https://raw.githubusercontent.com/paolosalvatori/aks-key-vault/main/jumpstart_drops/external-secrets-operator/artifacts/media/eso-az-kv-azure-kv.png",
  "Authors": [
    {
      "Name": "Paolo Salvatori",
      "Link": "https://www.linkedin.com/in/paolo-salvatori/"
    },
    {
      "Name": "Kiana Harris",
      "Link": "https://www.linkedin.com/in/kiana-harris-825b4b168/"
    }
  ],
  "Source": "https://github.com/paolosalvatori/aks-key-vault/tree/main/jumpstart_drops/external-secrets-operator",
  "Type": "script_automation",
  "Difficulty": "Medium",
  "ProgrammingLanguage": [
    "Bash",
    "Shell",
    "YAML"
  ],
  "Products": [
    "Azure Kubernetes Service",
    "Azure Key Vault",
    "External Secrets Operator"
  ],
  "LastModified": "2025-03-07T18:25:43.511Z",
  "CreatedDate": "2025-03-06T10:30:16.201Z",
  "Topics": [
    "AKS",
    "Kubernetes",
    "External Secrets Operator",
    "Secrets"
  ]
}