{
  "Title": "Dapr Secret Store for Key Vault",
  "Summary": "Dapr Secret Store for Key Vault can be summarized as follows: Allows applications to retrieve secrets from various secret stores, including Azure Key Vault. Simplifies secret management with Dapr's consistent API. Supports Azure Key Vault integration with managed identities. Supports third-party secret stores, such as Azure Key Vault, AWS Secret Manager, and Google Key Management, and HashiCorp Vault.",
  "Description": "Dapr (Distributed Application Runtime) is a versatile and event-driven runtime that simplifies the development of resilient, stateless, and stateful applications for both cloud and edge environments. It embraces the diversity of programming languages and developer frameworks, providing a seamless experience regardless of your preferences. Dapr encapsulates the best practices for building microservices into a set of open and independent APIs known as building blocks. These building blocks offer the following capabilities:\n\n1.  Enable developers to build portable applications using their preferred language and framework.\n2.  Are completely independent from each other, allowing flexibility and freedom of choice.\n3.  Have no limits on how many building blocks can be used within an application.\n\nDapr offers a built-in secrets building block that makes it easier for developers to consume application secrets from a secret store such as Azure Key Vault, AWS Secret Manager, and Google Key Management, and Hashicorp Vault.",
  "Cover": "https://raw.githubusercontent.com/paolosalvatori/aks-key-vault/refs/heads/main/images/secrets-overview-azure-aks-keyvault.png",
  "Authors": [
    {
      "Name": "Paolo Salvatori",
      "Link": "https://www.linkedin.com/in/paolo-salvatori/"
    }
  ],
  "Source": "https://github.com/paolosalvatori/aks-key-vault/tree/main/jumpstart_drops/dapr-secret-store",
  "Type": "script_automation",
  "Difficulty": "Medium",
  "ProgrammingLanguage": [
    "Bash",
    "Shell",
    "YAML"
  ],
  "Products": [
    "Azure Kubernetes Service",
    "Azure Key Vault",
    "Dapr"
  ],
  "LastModified": "2025-03-07T18:25:43.511Z",
  "CreatedDate": "2025-03-06T10:30:16.201Z",
  "Topics": [
    "AKS",
    "Kubernetes",
    "Dapr",
    "Secrets"
  ]
}