{
  {
  "Title": "External Secrets Operator with Azure Key Vault",
  "Summary": "This Jumpstart Drop demonstrates how to use the External Secrets Operator to manage secrets in Azure Key Vault and synchronize them as Kubernetes secrets. It leverages Microsoft Entra Workload ID for secure access and simplifies secret management within Kubernetes.",
  "Description": "This Jumpstart Drop provides a comprehensive guide on leveraging the External Secrets Operator in conjunction with Azure Key Vault. The External Secrets Operator, a Kubernetes operator, facilitates the management of secrets stored in external secret stores like Azure Key Vault. This drop specifically illustrates how to configure the operator to use Microsoft Entra Workload ID for authenticating to Azure Key Vault. By doing so, it enables the seamless synchronization of secrets from Azure Key Vault into Kubernetes secrets, making them easily consumable by applications running within the Kubernetes cluster. The drop covers the installation of the External Secrets Operator, the creation of managed identities and federated credentials, the configuration of the secret store custom resource, and the creation of ExternalSecret objects to retrieve and utilize secrets, keys, and certificates from Azure Key Vault. This approach simplifies secret management by providing a Kubernetes-native integration with Azure Key Vault.",
  "Cover": "https://raw.githubusercontent.com/paolosalvatori/aks-key-vault/main/jumpstart_drops/external-secrets-operator/artifacts/media/eso-az-kv-azure-kv.png",
  "Authors": [
    {
      "Name": "Paolo Salvatori",
      "Link": "https://www.linkedin.com/in/paolo-salvatori/"
    }
  ],
  "Source": "https://github.com/paolosalvatori/aks-key-vault/tree/main/jumpstart_drops/external-secrets-operator",
  "Type": "script_automation",
  "Difficulty": "Medium",
  "ProgrammingLanguage": [
    "Bash",
    "Shell",
    "YAML"
  ],
  "Products": [
    "Azure Kubernetes Service",
    "Azure Key Vault",
    "External Secrets Operator"
  ],
  "LastModified": "2025-03-07T18:25:43.511Z",
  "CreatedDate": "2025-03-06T10:30:16.201Z",
  "Topics": [
    "AKS",
    "Kubernetes",
    "External Secrets Operator",
    "Secrets"
  ]
}